

// let name = prompt('Ismingiz?');

// let age = confirm('18 yoshdan otkansizmi?')


//  let all  = alert(`${name} 
//  ${age?'Siz 18 yoshdan kattaroq':'Siz 18 yoshdan kichkinaroq'}`)

//  console.log(all);


// let num = +prompt('Ragam kiriting');
// let num2 = +prompt('Ragam kiriting n2');
// let sym = prompt('+ / - *')
//     if (sym == '+') {
//         console.log(num + num2);
//     }
//     if (sym == '-') {
//         console.log(num - num2);
//     }
//     if (sym == '/') {
//         console.log(num / num2);
//     }
//     if (sym == '*') {
//         console.log(num * num2);
//     }

   
// let num = +prompt('Ragam kiriting');
// let num2 = +prompt('Ragam kiriting n2');
// console.log(alert(num % num2));


// console.log(6 % 7);
// console.log(8 % 2);
// console.log(5 % 2);
// console.log(9 % 6);
// console.log(3 % 5);
// console.log(0 % 9);
// console.log(6 % 5);
// console.log(7 % 4);
// console.log(3 % 7);
// console.log(7 % 1);




//   let zal = alert('Songni top')
//   let num = +prompt('Yoz')

//   if (num == Math.floor(Math.random() * 2)) {
//     console.log('topding');
//  }else{
//     console.log('topalmading');
//     }


// let num = +prompt('raqam')

// if (num == '1') {
//   console.log(alert('Таба` рокал- лазий би- йадих,ил Мулку ва х,ува ъала к,улли шай*ин к,одийр'))
// }if (num == '2') {
//   console.log(alert('Аллазий х,олак,ол мавта валх,а- айа` та лийаблувакум аййукум ах,сана ъамала` , ва х,увал ъазийзул гофур'))
// }
// if (num == '3') {
//   console.log(alert(' Аллазий холако сабъа сама` ва` тин тиба` к,о. Ма` таро` фий холк,ир рах,мо` ни мин тафа` вут. Фаржиъил- басоро х,ал таро` мин футу` р'))
// }
// if (num == '4') {
//   console.log(alert('Суммаржиъил басоро карротайн йанколиб илайкал басору х,о` си-ав ва х,ува х,асийр'))
// }
// if (num == '5') {
//   console.log(alert(' Ва лак,од заййаннас- сама ` ад- дунйа` бимасо` бийх,а ва жаъална` х,а` ружу` мал лиш шайа` тийн. Ва аътадна лах,ум аъза` бас саъийр'))
// }
// if (num == '6') {
//   console.log(alert(' Ва лиллазийна к,афару` би- Роббих,им аъаз` жах,аннам, ва би* салмасийр'))
// }
// if (num == '7') {
//   console.log(alert(' Иза улку фийх,а самиъу` лах,а шах,ийк,он ва х,ийа тафу` р.'))
// }
// if (num == '8') {
//   console.log(alert(' Така` ду тамаййазу минал- г ой` з. Куллама  улк,ийа фийх,а фавжун са- алах,ум хозанатух а а лам йатикум назийр'))
// }
// if (num == '9') {
//   console.log(alert(' К,о` лу` бала к,од жа`` ана назийрун факаззабна ва кулна` ма` наззалаллох,у мин шай* ин ин антум илла фий зола` лин кабийр.'))
// }
// if (num == '10') {
//   console.log(alert(' Ва ко` лу` лав кунна` насмаъу ав наъкилу ма` кунна` фий асх,а` биссаъийр'))
// }
// if (num == '11') {
//   console.log(alert('Фаътарофу` бизамбих,им фасух,к,ол лиасх,а` биссаъийр'))
// }
// if (num == '12') {
//   console.log(alert('Инналлазийна йахшавна роббахум бил- гойби лах,ум маг фиротив ва ажрун кабийр.'))
// }
// if (num == '13') {
//   console.log(alert('Ва асирру` к,овлакум авижх,ару` бих,и` , иннах,у` ъалиймум биза` тис- суду` р'))
// }
// if (num == '14') {
//   console.log(alert('А ла` йаъламу ман х,олак,о ва х,увал- латий- фул х,обийр,'))
// }
// if (num == '15') {
//   console.log(alert('Х,уваллазий жаъала лакумул арзо за- лу` лан фамшу фий мана` к,ибих,а` ва кулу` мирризик,их,и ва илайх,ин- нушу` р'))
// }
// if (num == '16') {
//   console.log(alert(' А аминтум ман фисса- ма`` и аййах,сифа бикумул арзо фаиза` хийа таму`р.'))
// }
// if (num == '17') {
//   console.log(alert('А аминтум ман фис -сама`` и аййаурсила ъалакум х,осиба` фасатаъ` аламу` на кайфа назийр.'))
// }
// if (num == '18') {
//   console.log(alert('Ва лак,од каззабаллазийна мин к,облих,им фа кайфа к,а` на нак,ийр'))
// }
// if (num == '19') {
//   console.log(alert(' А ва лам йаров илаттойри фавк,ох,ум со` ` фа` тив ва йак,бизн. Ма йумсикхунна илларрохма` н. Иннх,у бикулли шай*им басийр'))
// }
// if (num == '20') {
//   console.log(alert('Амман х,азаллазий х,ува жундул лакум йансурукум мин ду` нир рох,ма` н. Инил- ка` фиру` на илла` фий гуру р'))
// }
// if (num == '21') {
//   console.log(alert('Амман х,а` заллазий йарзук,укум ин амсака ризк,ох,. Бал лажжу` фий ъутув-вив ва нуфу` р.'))
// }
// if (num == '22') {
//   console.log(alert('А фамай йамший мукиббан ъала` важх,их,` ах,да` аммай йамший савиййан ъала сиротим мустак,ийм.'))
// }
// if (num == '23') {
//   console.log(alert('Кул х,уваллазий анша * акум ва жаъала лакумуссамъа вал абсо` ра вал аф* идах,. К,олийлам ма` ташкурун.'))
// }
// if (num == '24') {
//   console.log(alert('Кул х,уваллазий зароакум фил арзи ва илах,и тух,шару` н.'))
// }
// if (num == '25') {
//   console.log(alert(' Ва йаку` лу` на мата` ха` зал ваъду ин кунтум содик,ийин.'))
// }
// if (num == '26') {
//   console.log(alert('К,ул иннамалъ илму ъиндалло` х,и ва иннама` ана назийрум мубийн.'))
// }
// if (num == '27') {
//   console.log(alert('Фафлама` роавх,у зулфатан си`` ат вужу` хуллазийна кафару` ва кийла х,а` заллазий кунтум бих,и тад- даъу` н'))
// }
// if (num == '28') {
//   console.log(alert('К,ул ароайтум ин ах,лаканийаллох,у ва мам маъийа ав рох,имана` фамай йужийрулка` фирийна мин ъаза` бин алийм. '))
// }
// if (num == '29') {
//   console.log(alert('К,ул х,уваррох,ма` ну а` манна` бих,и` ва ъалах,им таваккална` фасатаъаламу` на ман х,ива фий зола` лим мубийн.'))
// }
// if (num == '30') {
//   console.log(alert('Кул ароайтум ин асбах,а ма`` укум говран фамай йа*тик,ум бима`` им маъийн.'))
// }




function num(num,num2,sym){
  console.log(`${num} + ${num2} ${sym} ${num + num2} `);
}
num(1,2 ,'=')